###### task 1

In [2]:
# short the data in ascending order of sales and display the result
import pandas as pd

In [8]:
sales_data= pd.read_csv('DS1_C4_S3_SalesData_Practice.csv')

In [14]:
sales_data.sort_values(by='Sales',ascending=True)

   Month Store  Sales       State
0    Jan     A  21080      Alaska
13   Mar     D  21357     Montana
18   Apr     D  21394     Montana
14   Mar     E  22130  New Mexico
2    Jan     C  22369  California
24   May     E  22541  New Mexico
12   Mar     C  23475  California
9    Feb     E  23851  New Mexico
19   Apr     E  25184  New Mexico
15   Apr     A  26073      Alaska
4    Jan     E  27113  New Mexico
11   Mar     B  27215       Texas
5    Feb     A  27573      Alaska
25   Jun     A  28500      Alaska
23   May     D  28943     Montana
22   May     C  29697  California
27   Jun     C  30200  California
17   Apr     C  30279  California
6    Feb     B  31244       Texas
8    Feb     D  31768     Montana
26   Jun     B  32896       Texas
1    Jan     B  32985       Texas
10   Mar     A  33274      Alaska
28   Jun     D  37098     Montana
20   May     A  37649      Alaska
29   Jun     E  41098  New Mexico
21   May     B  44597       Texas
3    Jan     D  45710     Montana
16   Apr     B  45919       Texas
7    Feb     C  48624  California

###### task 2

In [22]:
sales_data[sales_data['Sales']>=45000]

   Month Store  Sales       State
3    Jan     D  45710     Montana
7    Feb     C  48624  California
16   Apr     B  45919       Texas

###### task 3

In [91]:
 data_california=sales_data.loc[(sales_data['State']=='California')]

In [92]:
 data_california.sort_values(by='Sales',ascending=True)

   Month Store  Sales       State
2    Jan     C  22369  California
12   Mar     C  23475  California
22   May     C  29697  California
27   Jun     C  30200  California
17   Apr     C  30279  California
7    Feb     C  48624  California

In [73]:
 data_Taxas=sales_data.loc[(sales_data['State']=='Texas')]

In [75]:
data_Taxas.sort_values(by='Sales',ascending=True)

   Month Store  Sales  State
11   Mar     B  27215  Texas
6    Feb     B  31244  Texas
26   Jun     B  32896  Texas
1    Jan     B  32985  Texas
21   May     B  44597  Texas
16   Apr     B  45919  Texas

In [76]:
 data_Montana=sales_data.loc[(sales_data['State']=='Montana')]

In [82]:
data_Montana.sort_values(by='Sales',ascending=True)

   Month Store  Sales    State
13   Mar     D  21357  Montana
18   Apr     D  21394  Montana
23   May     D  28943  Montana
8    Feb     D  31768  Montana
28   Jun     D  37098  Montana
3    Jan     D  45710  Montana

###### task 4

In [100]:
sum_colif=data_california['Sales'].sum()
print( "total sales in the state of california:",sum_colif)

total sales in the state of california: 184644

In [99]:
Montana_sum=data_Montana['Sales'].sum()
print( "total sales in the state of Montana:",Montana_sum)

total sales in the state of Montana: 186270

In [97]:
taxas_sum=data_Taxas['Sales'].sum()
print( "total sales in the state of taxas:",taxas_sum)

total sales in the state of taxas: 214856

###### task 5

In [101]:
 data_california=sales_data.loc[(sales_data['State']=='California')]
data_california

   Month Store  Sales       State
2    Jan     C  22369  California
7    Feb     C  48624  California
12   Mar     C  23475  California
17   Apr     C  30279  California
22   May     C  29697  California
27   Jun     C  30200  California

In [111]:
data_california.max()

Month           May
Store             C
Sales         48624
State    California
dtype: object

In [112]:
data_california.min()

Month           Apr
Store             C
Sales         22369
State    California
dtype: object

In [113]:
data_Montana.max()

Month        May
Store          D
Sales      45710
State    Montana
dtype: object

In [114]:
data_Montana.min()

Month        Apr
Store          D
Sales      21357
State    Montana
dtype: object

In [115]:
data_Taxas.max()

Month      May
Store        B
Sales    45919
State    Texas
dtype: object

In [116]:
data_Taxas.min()

Month      Apr
Store        B
Sales    27215
State    Texas
dtype: object

###### task 6

In [117]:
department_sum = df.groupby('Department')['Salary'].sum().reset_index()

NameError: name 'df' is not defined

In [123]:
total_sales=sales_data.groupby('State')['Sales'].sum()

In [124]:
total_sales

State
Alaska        174149
California    184644
Montana       186270
New Mexico    161917
Texas         214856
Name: Sales, dtype: int64